---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.DocumentSavingAsEventArgs
source: html/b4c2de5b-bc4a-3506-30b1-308d0e91354c.htm
---
# DocumentSavingAsEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.